export default {
  state: {
    validation: {
      letters: /^([A-z\-' ÀÁÂÃÇÈÉÊÌÍàáâãçèéêìíÒÓÔÕÙÚòóôõùú]*$){3,}/,
      numbers: /[0-9]/,
      date: /(^(((0[1-9]|[12][0-9])[/](0[1-9]|1[012]))|((29|30|31)[/](0[13578]|1[02]))|((29|30)[/](0[4,6,9]|11)))[/](19\d\d|200\d)$)|(^29[/]02[/](19|[2-9][0-9])(00|04|08|12|16|20|24|28|32|36|40|44|48|52|56|60|64|68|72|76|80|84|88|92|96)$)/,
      phone: /^(?:\(?([1-9]{2})\)?[ ]?)((?:9)([0-9]{4})|[1-8]([0-9]{3}))[-. ]?([0-9]{4})$/,
      maskedPhone: /^(?:\(?([1-9*]{2})\)?[ ]?)((?:9)([0-9*]{4})|[1-8*]([1-9*]{3}))[-. ]?([0-9*]{4})$/,
      email: /^(([^<>()[\]\\.,;:\-_\s@"'ÀÁÂÃÇÈÉÊÌÍàáâãçèéêìíÒÓÔÕÙÚòóôõùú+]+(((\.)|(-)|(_))[^<>()[\]\\.,;:\-_\s@"'ÀÁÂÃÇÈÉÊÌÍàáâãçèéêìíÒÓÔÕÙÚòóôõùú+]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
      cnpj: /^[0-9]{2,3}.[0-9]{3}.[0-9]{3}\/[0-9]{4}-[0-9]{2}$/,
      cpf: /^[0-9]{3}.[0-9]{3}.[0-9]{3}-[0-9]{2}$/,
      noSpecial: /^[A-z0-9\-'ÀÁÂÃÇÈÉÊÌÍàáâãçèéêìíÒÓÔÕÙÚòóôõùú .]{3,50}$/,
      personName: /^[A-z\-'ÀÁÂÃÇÈÉÊÌÍàáâãçèéêìíÒÓÔÕÙÚòóôõùú]{2,50}(?: [A-z\-'ÀÁÂÃÇÈÉÊÌÍàáâãçèéêìíÒÓÔÕÙÚòóôõùú]{1,50})+ ?$/,
      cardName: /^[A-z\-'ÀÁÂÃÇÈÉÊÌÍàáâãçèéêìíÒÓÔÕÙÚòóôõùú]{1,50}(?: [A-z\-'ÀÁÂÃÇÈÉÊÌÍàáâãçèéêìíÒÓÔÕÙÚòóôõùú]{1,50})+ ?$/,
      addressNumber: /^([0-9]{1,10}[a-zA-Z]?)$|^(?:S|s)(\/)(?:N|n)$|^(?:SN|sn)$/,
      validMail: /^[a-z9áàâãéèêíïóôõöúçñ][a-z0-9áàâãéèêíïóôõöúçñ^%$#!~,? _.-]*@[a-z0-9áàâãéèêíïóôõöúçñ^%$#!~,? .-]+[a-záàâãéèêíïóôõöúçñ^%$#!~,?. _-]{0,}$/,
      validMailSpacer: /^[a-z9áàâãéèêíïóôõöúçñ][a-z0-9áàâãéèêíïóôõöúçñ^%$#!~,?_.-]*@[a-z0-9áàâãéèêíïóôõöúçñ^%$#!~,?_.-]+[a-záàâãéèêíïóôõöúçñ^%$#!~,?_.-]{0,}$/,
      validMailHyphen: /^[a-z9áàâãéèêíïóôõöúñ][a-z0-9áàâãéèêíïóôõöúñ _.-]*@[a-z0-9áàâãéèêíïóôõöúñ .-]+[a-záàâãéèêíïóôõöúñ ]{0,}$/,
      validMailAccent: /^[a-z9][a-z0-9^%$#!~,? _.-]*@[a-z0-9^%$#!~, ?.-]+[a-z^%$#!~, ?]{0,}$/,
      validFantasia: /^((?!\b(stelo|maquina|mini|mob|maq|max|bradesc|maquininha|stello|maquineta|compra|sim|mini|teste|máquina)\b).)*$/i
    }
  },

  getters: {
    validation: state => {
      return state.validation
    }
  }
}
